MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
/*
 * app.c
 *
 *  Created on: Apr 29, 2024
 *      Author: Jan Mareš
 */


#include "main.h"
#include "app.h"
#include "max7219.h"
#include "usbpd_def.h"
#include "usbpd_dpm_user.h"
#include "usbpd_pwr_user.h"
#include "usbpd_user_services.h"
#include "string.h"
#include "stdio.h"
#include "stdbool.h"
#include <stm32g0xx_ll_adc.h>

#include "usb_device.h"
#include "usbd_cdc_if.h"
#include <usbpd_trace.h>

int32_t fullyCompensatedVoltageV;
int32_t currentCompensatedVoltageV;
int32_t compVoltageV;
int32_t currentErrorV;
uint64_t term1V;
uint64_t term2V;
int64_t	voltageErrorV;
int32_t voltageErrorRoundedV;

int32_t BSP_USBPD_PWR_VBUSGetCurrentOCP(uint32_t Instance, int32_t *pCurrentOCP);
int32_t BSP_PWR_VBUSGetCurrentOCP(uint32_t PortId);

//Variables declaration
int dac_value = 500;

USBPD_DPM_SNKPowerRequestDetailsTypeDef powerRequestDetails;

__IO uint16_t aADCxConvertedValues[ADC_NUM_OF_SAMPLES] = {0};

//USB communication
uint8_t usb_buffer[64]; //in C, array automaticaly decays to pointer to first element uint8_t*

uint8_t *getUSBbuffer(void) {
	return usb_buffer;
}

//Initialize button event and time struct
SystemEvents_TypeDef systemEvents = {0};
BtnPressTimes_TypeDef btnPressTimes = {0};
volatile uint32_t debouncedPins = 0;  // Bitmask for tracking debounced buttons

//Init stateMachine struct
StateMachine_TypeDef stateMachine = {
		.currentState = STATE_INIT,
		.comState = STATE_CLOSED,
		.lockMode = UNLOCKED,
		.OCPMode = OCP_ENABLED,
		.pwrMode = MODE_FIXED,
		.encoder = {
				.selDigit = 2,
				.increment = 10    // Default increment
			}
};

//Init SINKData struct
SINKData_HandleTypeDef SNK_data = {
	.voltageMin = 500, //initial min voltage
	.voltageSet = 500, //initial value to display
	.voltageMax = 500, //initial max voltage
	.currentSet = 1000, //initial value to display
	.awdgTresholdSet = 744, //set initial OCP to 1A
	.currentMin = 0,
	.currentOCPSet = 1000,
	.selMethod = PDO_SEL_METHOD_MAX_CUR,
	.hasAPDO = false,
	.srcProfiles[0].profileType = UNKNOWN,
};

// Define the pointer to the struct
SINKData_HandleTypeDef *dhandle = &SNK_data;
StateMachine_TypeDef *sm = &stateMachine;
SystemEvents_TypeDef *events = &systemEvents;


// Callback when ADC conversion is complete
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
  //HAL_GPIO_TogglePin(LED_USER_GPIO_Port, LED_USER_Pin);
}

// Callback when ADWG2 (CH7 ISENSE) goes out of range
void HAL_ADCEx_LevelOutOfWindow2Callback(ADC_HandleTypeDef *hadc) {
	systemEvents.awdgEvent = true;
	//Disable output
	HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);
}

/**
 * Update ADC CH3 AWD Treshold
 * Possibility to update parameters on the fly (read more in HAL_ADC_AnalogWDGConfig declaration)
 * Full config and AWD init in main.c
 */
void Update_AWD_Thresholds(uint32_t low, uint32_t high, uint32_t adc_watchdog) {
		// Just update the thresholds for an already configured AWD
		ADC_AnalogWDGConfTypeDef AnalogWDGConfig = {0};
		AnalogWDGConfig.WatchdogNumber = adc_watchdog; // Specify which AWD you're updating
		AnalogWDGConfig.HighThreshold = high;
		AnalogWDGConfig.LowThreshold = low;
		if (HAL_ADC_AnalogWDGConfig(&hadc1, &AnalogWDGConfig) != HAL_OK)
		{
		    Error_Handler();
		}
}
/*
 * Initialization function
 */
void app_init(void){
	//TIM4 initialization
	HAL_TIM_Base_Start(&htim4);

	//TIM7 initialization
	LL_TIM_ClearFlag_UPDATE(TIM7); //Clear update flag on TIMER7
	LL_TIM_EnableIT_UPDATE(TIM7); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	//LL_TIM_ClearFlag_UPDATE(TIM7); //Clear update flag on TIMER7

	//TIM14 initialization
	LL_TIM_DisableIT_UPDATE(TIM14); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	LL_TIM_ClearFlag_UPDATE(TIM14); //Clear update flag on TIMER14

	//TIM14 initialization
	LL_TIM_DisableIT_UPDATE(TIM15); //Enable interrupt generation when timer goes to max value and UPDATE event flag is set
	LL_TIM_ClearFlag_UPDATE(TIM15); //Clear update flag on TIMER14

	//TIM3 initialization of encoder
	HAL_TIM_Encoder_Start_IT(&htim3, TIM_CHANNEL_ALL);
	uint32_t maxCounterValue = __HAL_TIM_GET_AUTORELOAD(&htim3); // Get the max value
	__HAL_TIM_SET_COUNTER(&htim3, maxCounterValue / 2); // Set the counter to half of the max value to avoid shift from 0 -> max value
	sm->encoder.curValue = __HAL_TIM_GET_COUNTER(&htim3)/4;
	sm->encoder.prevValue = sm->encoder.curValue;

	//Init DAC
	HAL_DAC_Start(&hdac1, DAC_CHANNEL_1);
	HAL_DAC_SetValue(&hdac1, DAC_CHANNEL_1, DAC_ALIGN_12B_R, dac_value);

	//Wait for hardware initialization and then turn DB to HIGH (according to TCPP01-M12 datasheet 6.5)
	HAL_Delay(200);
	HAL_GPIO_WritePin(DB_OUT_GPIO_Port, DB_OUT_Pin, GPIO_PIN_SET);

	//Calibrate and start ADC sensing with DMA
	HAL_ADCEx_Calibration_Start(&hadc1);
	HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&aADCxConvertedValues, ADC_NUM_OF_SAMPLES);

	//Set initial OCP treshold
	Update_AWD_Thresholds(0, dhandle->awdgTresholdSet, ADC_ANALOGWATCHDOG_2); //~1A
	HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_SET);

	//Init 7 segment display
	max7219_Init( SEGMENT_DISP_INTENSIVITY );
	max7219_Decode_On();

	//HAL_GPIO_WritePin(OCP_RESET_GPIO_Port, OCP_RESET_Pin, GPIO_PIN_SET);
}


/*
 * Main loop function
 */
void app_loop(void) {
	// Process button events
	processSystemEvents();

	// Run the state machine
	runStateMachine();

	// Reset button states after processing
	stateMachine.outputBtnPressed = false;
	stateMachine.lockBtnPressed = false;
	stateMachine.lockBtnLongPressed = false;
	stateMachine.voltageCurrentBtnPressed = false;
	stateMachine.voltageCurrentBtnLongPressed = false;
	stateMachine.rotaryBtnPressed = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.stateTimeoutFlag = false;
	stateMachine.periodicCheckFlag = false;
	stateMachine.encoderTurnedFlag = false;
	stateMachine.awdgTriggeredFlag = false;
}

/*
 * Main function for state machine
 */
void runStateMachine(void) {
	// Process events and transitions
	switch (sm->currentState) {
		case STATE_OFF:
			//handleOffState();
			break;
		case STATE_INIT:
			handleInitState();
			break;
		case STATE_IDLE:
			handleIdleState();
			break;
		case STATE_ACTIVE:
			handleActiveState();
			break;
		case STATE_ERROR:
			//handleErrorState();
			break;
		case STATE_SET_VALUES:
			handleSetValuesState();
			break;
		default:
			// Error handling
			sm->currentState = STATE_ERROR;
			//sm->errorCode = ERROR_INVALID_STATE;
			break;
	}

