MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
}

/*
 * Define Callbacks and ISR
 */

//BTN ISR to set event flags
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
        btnPressTimes.voltageCurrentBtn = HAL_GetTick();
        systemEvents.btnPressEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM2);
    } else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {
        btnPressTimes.lockBtn = HAL_GetTick();
        systemEvents.btnPressEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM4);
    } else if (GPIO_Pin == SW3_OFF_ON_Pin) {
        systemEvents.outputBtnEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM1);
    } else if (GPIO_Pin == ENC_TOGGLE_UNITS_Pin) {
        systemEvents.rotaryBtnEvent = true;
        //EXTI->IMR1 &= ~(EXTI_IMR1_IM8);
    }

    // Store the pressed button in bitmask for tracking debounce
    debouncedPins |= GPIO_Pin;
    // Mask the interrupt for this button
    EXTI->IMR1 &= ~GPIO_Pin;

    // Start debounce timer
    TIM7->ARR = DEBOUNCE_TIME_MS;
    LL_TIM_SetCounter(TIM7, 0);
    LL_TIM_EnableCounter(TIM7);
}

/*
 * Define Callbacks and ISR
 */

//BTN ISR to set event flags
void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin) {

	if (systemEvents.btnPressEvent == true) {
		uint32_t releaseTime = HAL_GetTick();

		// Decide between long/short presses
		if (GPIO_Pin == SW1_TOGGLE_I_V_Pin) {
			if ((releaseTime - btnPressTimes.voltageCurrentBtn) > 1000) {
				systemEvents.voltageCurrentBtnLongEvent = true;
			} else {
				systemEvents.voltageCurrentBtnEvent = true;
			}

		} else if (GPIO_Pin == SW2_DEBUG_BTN_Pin) {

			if ((releaseTime - btnPressTimes.lockBtn) > 1000) {
				systemEvents.lockBtnLongEvent = true;
			} else {
				systemEvents.lockBtnEvent = true;
			}
		} else {
			return;
		}

		// Start debounce timer
		TIM7->ARR = DEBOUNCE_TIME_MS;
		LL_TIM_SetCounter(TIM7, 0);
		LL_TIM_EnableCounter(TIM7);

		// Reset btnPressEvent
		systemEvents.btnPressEvent = false;

		// Store the pressed button in bitmask for tracking debounce
		debouncedPins |= GPIO_Pin;
		// Mask the interrupt for this button
		EXTI->IMR1 &= ~GPIO_Pin;
	}
}

//TIM capture callback
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) {
    if (htim->Instance == TIM3) {
    	systemEvents.encoderTurnEvent = true;
    }
}

/*
 * Timer7 interrupt routine for button debouncing
 */
void TIM7_ISR(void){
	//Clear TIM update flag and stop timer
	LL_TIM_ClearFlag_UPDATE(TIM7);
	LL_TIM_DisableCounter(TIM7);

	EXTI->IMR1 |= debouncedPins; // Unmask debounced pins
	EXTI->FPR1 = debouncedPins; // clear falling edge interrupt
	EXTI->RPR1 = debouncedPins; // clear rising edge interrupt

	// Reset the bitmask after unmasking
	debouncedPins = 0;

}

/*
 * TIM14 interrupt routine for periodic check inside states
 *
 */
void TIM14_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM14)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM14);

		// Handle periodic check for ACTIVE state
		systemEvents.periodicCheckEvent = true;
		//Reset CNT value
		LL_TIM_SetCounter(TIM14, 0);

		//Start timer again
		LL_TIM_EnableCounter(TIM14);
	}
}

/*
 * TIM15 interrupt routine for timeouts of states
 *
 */
void TIM15_ISR(void) {
	if (LL_TIM_IsActiveFlag_UPDATE(TIM15)) {
		// Clear the update interrupt flag
		LL_TIM_ClearFlag_UPDATE(TIM15);

		// Handle periodic check for ACTIVE state
		systemEvents.stateTimeoutEvent = true;
		//Reset CNT value
		//LL_TIM_DisableCounter(TIM15);  // Stop the timer after timeout
	}
}

/*
 * Define Process functions
 */
// Process button events in the main loop (Convert hardware events into logical events)
void processButtonEvents(void) {
    if (events->outputBtnEvent) {
    	//Reset btn event flag
        events->outputBtnEvent = false;
        sm->outputBtnPressed = true;

    } else if (events->voltageCurrentBtnEvent) {
    	events->voltageCurrentBtnEvent = false;
    	sm->voltageCurrentBtnPressed = true;
    } else if (events->voltageCurrentBtnLongEvent) {
       	events->voltageCurrentBtnLongEvent = false;
       	sm->voltageCurrentBtnLongPressed = true;

       	// Toggle pwrMode
       	if (sm->pwrMode == MODE_FIXED) {
       		sm->pwrMode = MODE_APDO;
       	} else {
       		sm->pwrMode = MODE_FIXED;
       	}

    } else if (events->lockBtnEvent) {
    	events->lockBtnEvent = false;

    	if (sm->lockMode == UNLOCKED) {
    		sm->lockBtnPressed = true;
    		int isense_Vtrip_mV;
    		int isense_rawADCtrip;

			//Toggle OCP mode
			switch(sm->OCPMode) {
				case OCP_DISABLED:
					sm->OCPMode = OCP_ENABLED;

					//Set lock LED
					HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_SET);

					//Update AWD limits
					isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
					isense_rawADCtrip = (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
					dhandle->awdgTresholdSet = isense_rawADCtrip;
					Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
					break;
				case OCP_ENABLED:
					sm->OCPMode = OCP_DISABLED;

					//Reset lock LED
					HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_RESET);

					//If OCP disabled by user, set it to source max current
					isense_Vtrip_mV = (dhandle->currentMax *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
					isense_rawADCtrip = (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
					dhandle->awdgTresholdSet = isense_rawADCtrip;
					Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);

					//__HAL_ADC_DISABLE_IT(&hadc1, ADC_IT_AWD2); can be also used to write bit but
					//only when ADSTART bit is cleared to 0 (this ensures that no conversion is ongoing).
					break;
			}
    	}

    } else if (events->lockBtnLongEvent) {
    	events->lockBtnLongEvent = false;
    	sm->lockBtnLongPressed = true;

    	if (sm->lockMode == LOCKED) {
    		sm->lockMode = UNLOCKED;

    		//Drive lock LED
    		//HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_RESET);
    		HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_RESET);


    		// Mask buttons except OUT
    		EXTI->IMR1 |= EXTI_IMR1_IM8; //unmask ENCbtn
    		EXTI->IMR1 |= EXTI_IMR1_IM2; //unmask SW1 I/V
    	} else {
    		sm->lockMode = LOCKED;

    		// Drive lock LED
    		//HAL_GPIO_WritePin(LED_LOCK_GPIO_Port, LED_LOCK_Pin, GPIO_PIN_SET);
    		HAL_GPIO_WritePin(LED_USER_GPIO_Port, LED_USER_Pin, GPIO_PIN_SET);

    		// Unmask buttons except OUT
    		EXTI->IMR1 &= ~(EXTI_IMR1_IM2); // mask SW1 I/V
    		EXTI->IMR1 &= ~(EXTI_IMR1_IM8); // mask ENCbtnt
    	}

    } else if (events->rotaryBtnEvent) {
    	// Reset btn event flag
    	events->rotaryBtnEvent = false;
		sm->rotaryBtnPressed = true;

