MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
	}
    else if (strcmp(cmd_part, "ISET1?") == 0)
  	{
    	// Convert mA to A and format as "X.XXX A"
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentSet / 1000, dhandle->currentSet % 1000);
  	}
    else if (strcmp(cmd_part, "OUT0") == 0)
   	{
   		snprintf(response, sizeof(response), "Output disabled\r\n");
   	    // Simulate button press if device is in active state
   		if (sm->currentState == STATE_ACTIVE) {
   	   		sm->outputBtnPressed = true;
   		}
   	}
    else if (strcmp(cmd_part, "OUT1") == 0)
	{
		snprintf(response, sizeof(response), "Output enabled\r\n");

		// Simulate button press if device is in idle state
		if (sm->currentState == STATE_IDLE) {
			sm->outputBtnPressed = true;
		}
	}
    else if (strcmp(cmd_part, "VOUT1?") == 0)
   	{
    	// Query measured output voltage
   		snprintf(response, sizeof(response), "Measured output voltage: %lu.%02lu V\r\n", dhandle->voltageMeas / 1000, dhandle->voltageMeas % 1000);
   	}
    else if (strcmp(cmd_part, "IOUT1?") == 0)
   	{
    	// Query measured output current
  		snprintf(response, sizeof(response), "Current is set to: %lu.%03lu A\r\n", dhandle->currentMeas / 1000, dhandle->currentMeas % 1000);
   	}
    else if (strcmp(cmd_part, "*IDN?") == 0)
	{
    	// Return device identification string
		snprintf(response, sizeof(response), "PPS-SINK-v0.2 (100W,21V,5A)\r\n");
	}
    else if (strcmp(cmd_part, "PROFILES?") == 0)
   	{
    	// Query available power profiles
    	bool printToCOM = true;
    	sourcecapa_limits(printToCOM);
   	}
    else
    {
    	// Handle unknown commands
        snprintf(response, sizeof(response), "Unknown command\r\n");
    }

    // Send response back to host
    CDC_Transmit_FS((uint8_t*)response, strlen(response));
}

/*
 * Define state Handle functions
 */
void handleInitState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
    	// Set the state entry time and timeout duration
		sm->stateEntryTime = HAL_GetTick();
		sm->timeoutCounter = 5000;  // 2 seconds timeout

        // Save state for return from temporary states
        sm->lastState = STATE_INIT;

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================


    //=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================
    if (dhandle->srcProfiles[0].profileType != UNKNOWN) {
    	// Display maximal values
    	max7219_PrintIspecial(SEGMENT_2, dhandle->currentMax, 4);
    	max7219_PrintIspecial(SEGMENT_1, dhandle->voltageMax, 3);

    	// If APDO available set APDO mode
    	if (dhandle->hasAPDO == true) {
    		sm->pwrMode = MODE_APDO;
    	} else {
    		sm->pwrMode = MODE_FIXED;
    	}

    	// Check if the timeout has elapsed
		if (HAL_GetTick() - sm->stateEntryTime > sm->timeoutCounter) {
			//After initialization transition to IDLE state
			sm->currentState = STATE_IDLE;
			entryDone = false;
		}
    }

    //=================================================
    // EXIT ACTIONS - Things to be done during exit
    //=================================================
}

void handleIdleState(void) {
    // Entry actions (if just entered this state)
    static bool entryDone = false;

    //=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================
    if (!entryDone) {
        // Display set values
        max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
        max7219_PrintIspecial(SEGMENT_1, dhandle->voltageSet, 3);

        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);

        // Save state for return from temporary states
        sm->lastState = STATE_IDLE;

        entryDone = true;
    }

    //=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================

    // Process events and transitions
    if (sm->outputBtnPressed) {
        sm->currentState = STATE_ACTIVE;
        entryDone = false;
    } else if (sm->rotaryBtnPressed) {
        sm->currentState = STATE_SET_VALUES;
        if (sm->comState == STATE_CLOSED) {
        	sm->timeoutCounter = 4000;  // 4 seconds timeout
        }
        sm->rotaryBtnPressed = false;
        entryDone = false;
    }

    //=================================================
    // EXIT ACTIONS - Things to be done during exit
    //=================================================
}

void handleActiveState(void) {
	// Entry actions (if just entered this state)
    static bool entryDone = false;
    static int8_t periodicCheckFlagCounter = 0;


	//=======================================================
	// ENTRY ACTIONS - Executed once when entering the state
	//=======================================================

    if (!entryDone) {
        // Ensure output is off
        HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_SET);

        // Save state for return from temporary states
        sm->lastState = STATE_ACTIVE;

        // Initialize the periodic check timer
        TIM14->ARR = 500;
		LL_TIM_SetCounter(TIM14, 0); //set counter register value of timer 14 to 0
		LL_TIM_EnableIT_UPDATE(TIM14); // Enable update interrupt
		LL_TIM_EnableCounter(TIM14);

        entryDone = true;
    }

    //==========================================================
	// DO ACTIONS - Executed every time the state is processed
	//==========================================================

    //Periodic check to display measured values
    if (sm->periodicCheckFlag) {
		uint32_t vol = BSP_PWR_VBUSGetVoltage(0); // [mV]
		uint32_t cur = BSP_PWR_VBUSGetCurrent(0); // [mA]

