MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
				//IF OCP enabled update the tresholds
				if (sm->OCPMode == OCP_ENABLED) {
					//Update AWD limits
					int isense_Vtrip_mV = (dhandle->currentSet *G_SENSE*R_SENSE_MOHMS)/1000; // mV  (mA * mOhms * Gain)
					int isense_rawADCtrip= (isense_Vtrip_mV *4095) / VDDA_APPLI; //value for AWD treshold
					dhandle->awdgTresholdSet = isense_rawADCtrip;
					Update_AWD_Thresholds(0, isense_rawADCtrip, ADC_ANALOGWATCHDOG_2);
				}
				break;
		}
	}


	//=================================================
	// TRANSITION CHECKS - Check for state transitions
	//=================================================

    // If timeout from setValues make USB PD request with new values
    if (sm->stateTimeoutFlag) {

    	// BUILD AND SEND REQUEST //
		if (sm->pwrMode == MODE_APDO) {
			uint32_t cur = BSP_PWR_VBUSGetCurrent(0);
			dhandle->currentMeas = correctCurrentMeas(cur);
			// Compensate voltage for losses on shunt resistors
			uint32_t compVoltage = compensateVoltage(dhandle->currentMeas); // [cV]
			// Find index via USER_SERV_FindSRCIndex() based on requested values
			int indexSRCAPDO = USER_SERV_FindSRCIndex(0, &powerRequestDetails, compVoltage*10, dhandle->currentSet, dhandle ->selMethod);
			// Print to debug
			char _str[70];
			sprintf(_str,"APDO request: indexSRCPDO= %i, VBUS= %lu mV, Ibus= %lu mA", indexSRCAPDO, compVoltage*10, dhandle->currentSet);
			USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
			// Send request to Policy Engine
			USBPD_DPM_RequestSRCPDO(0, indexSRCAPDO, compVoltage*10, dhandle->currentSet);
		}
		else if (sm->pwrMode == MODE_FIXED){
			// Use index from updateVoltage()
			int indexSRCPDO = dhandle->selectedProfile +1;
			// Print to debug
			char _str[70];
			sprintf(_str,"APDO request: indexSRCPDO= %i, VBUS= %lu mV, Ibus= %lu mA", indexSRCPDO, 10*dhandle->voltageSet, dhandle->currentSet);
			USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
			// Send request to Policy Engine
			USBPD_DPM_RequestSRCPDO(0, indexSRCPDO, dhandle->voltageSet*10, dhandle->currentSet);
		}

    	//Return to last (previous) state
	    if (sm->lastState == STATE_IDLE) {
	        sm->currentState = STATE_IDLE;
	    } else if (sm->lastState == STATE_ACTIVE) {
	        sm->currentState = STATE_ACTIVE;
	    }
	    entryDone = false;
    }

    //=================================================
    // EXIT ACTIONS - Things to be done during exit
    //=================================================
	if (!entryDone) {
		LL_TIM_DisableCounter(TIM14);
	}

}

// Legacy function for handling INA301
/*
void sw2_lock_isr(void){
	//Mask unwanted button interrupts caused by debouncing on exti line 2 (PB2)
	EXTI->IMR1 &= ~(EXTI_IMR1_IM2);

	//Mask alert pin during setting the relay on/off
	//EXTI->IMR1 &= ~(EXTI_IMR1_IM6);

	//Set debouncing time in ms
	TIM7->ARR = 200;

	//Zero TIM7 counter and start counting
	LL_TIM_SetCounter(TIM7, 0); //set counter register value of timer 7 to 0
	LL_TIM_EnableCounter(TIM7); //start counting of timer 7

	char _str[60];

	if (outputState == OUTPUT_OFF_STATE)
			{
				outputState = OUTPUT_ON_STATE;
				//Mask unwanted button interrupts caused by debouncing on exti line 6 (PD6)
				EXTI->IMR1 &= ~(EXTI_IMR1_IM6);

				//Set debouncing time in 6 ms
				TIM14->ARR = 6;
				//Zero TIM7 counter and start counting
				LL_TIM_SetCounter(TIM14, 0); //set counter register value of timer 7 to 0
				LL_TIM_EnableCounter(TIM14); //start counting of timer 7

				//put OCP to transparent mode so any alert during on/off is cleared
				//HAL_GPIO_WritePin(OCP_RESET_GPIO_Port, OCP_RESET_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_SET);
				// Use snprintf to limit the number of characters written
				int len = snprintf(_str, sizeof(_str), "--------Output Disabled--------");

			}
			else {
				outputState = OUTPUT_OFF_STATE;
				HAL_GPIO_WritePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin, GPIO_PIN_RESET);
				// Use snprintf to limit the number of characters written
				int len = snprintf(_str, sizeof(_str), "--------Output Enabled--------");

				//Display voltage
				max7219_PrintIspecial(SEGMENT_1,dhandle->voltageSet, 3);
				//Display current
				max7219_PrintIspecial(SEGMENT_2, dhandle->currentSet, 4);
			}

	//HAL_GPIO_TogglePin(RELAY_ON_OFF_GPIO_Port, RELAY_ON_OFF_Pin);
	//Get Voltage level into TRACE
	USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
}*/

/**
  * @brief  Extract source (adapter) capabilities and save them to SNKData_handle. If required print those capa. also to COM
  * @param  printToCom: Bool for specifying to print/not print to COM
  * @retval None
  * source: demo_disco.c Display_sourcecapa_menu_nav
  */
void sourcecapa_limits(bool printToCOM)
{
	// Entry actions (if just entered this state)
	static bool firstEntry = true;

	uint8_t _max = DPM_Ports[0].DPM_NumberOfRcvSRCPDO;
	uint8_t _start = 0;
	//SINKData_HandleTypeDef *dhandle = &SNK_data;
	dhandle->numProfiles = _max;
	static char all_profiles[500] = {0}; // Buffer for all profiles
	uint16_t offset = 0; // Position tracker in the all_profiles buffer

	// Clear the buffer at the start
	memset(all_profiles, 0, sizeof(all_profiles));

	for(int8_t index=_start; index < _max; index++)
	{
		char _str[50] = {0};

		switch(DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_TYPE_Msk)
		{
			case USBPD_PDO_TYPE_FIXED :
			{
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_FIXED_MAX_CURRENT_Pos)*10;
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_FIXED_VOLTAGE_Msk) >> USBPD_PDO_SRC_FIXED_VOLTAGE_Pos)*50;
				sprintf((char*)_str, "FIXED:%2dV %2d.%dA \r\n", (int)(maxvoltage/1000), (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));

				// Extract min and max values
				if (maxvoltage > dhandle->voltageMax*10) {
					dhandle -> voltageMax = (int)maxvoltage/10;
				}
				if (maxcurrent > dhandle->currentMax) {
					dhandle -> currentMax = (int)maxcurrent;
				}

				// Copy profiles to SNK data
				if (firstEntry) {
					if ((maxvoltage/1000 * maxcurrent/1000) <= 100) {
						dhandle->srcProfiles[index].voltageMax = maxvoltage/10; //save in centivolts
						dhandle->srcProfiles[index].currentMax = maxcurrent; //save in mA
						dhandle->srcProfiles[index].profileType = FIXED;
					}
				}

				break;
			}
			case USBPD_PDO_TYPE_BATTERY :
			{
			}
			break;
			case USBPD_PDO_TYPE_VARIABLE :
			{
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_VOLTAGE_Pos) * 50;
				uint32_t minvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_VARIABLE_MIN_VOLTAGE_Pos) * 50;
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_VARIABLE_MAX_CURRENT_Pos) * 10;
				sprintf((char*)_str, "V:%2d.%1d-%2d.%1dV %d.%dA \r\n", (int)(minvoltage/1000),(int)(minvoltage/100)%10, (int)(maxvoltage/1000),(int)(maxvoltage/100)%10, (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));
			}
			break;
			case USBPD_PDO_TYPE_APDO :
			{
				uint32_t minvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MIN_VOLTAGE_Pos) * 100;
				uint32_t maxvoltage = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Msk) >> USBPD_PDO_SRC_APDO_MAX_VOLTAGE_Pos) * 100;
				uint32_t maxcurrent = ((DPM_Ports[0].DPM_ListOfRcvSRCPDO[index] & USBPD_PDO_SRC_APDO_MAX_CURRENT_Msk) >> USBPD_PDO_SRC_APDO_MAX_CURRENT_Pos) * 50;
				sprintf((char*)_str, "APDO:%2d.%1d-%2d.%1dV %d.%dA \r\n",(int) (minvoltage/1000),(int)(minvoltage/100)%10, (int)(maxvoltage/1000),(int)(maxvoltage/100)%10, (int)(maxcurrent/1000), (int)((maxcurrent % 1000) /100));

