MaroshCZ/Power-Supply-USB-C/STM32G0_USBPD_Sink_1.2/Application/app.c
// Make voltage correction for the voltage drop in system.
// Purpose of this compensation is approximation of the voltageDrop
// based on measured current before the request is made.
// Since it is based on currentMeas, it works only when OUT is enabled.
// This should give us Uout close to user desired Uset.
// Characteristic was obtained from PinePower 65W adapter.
uint32_t compensateVoltage(uint32_t measuredCurrent) {
	// Using the formula: voltageDrop = 0.2942x * x - 49.8529
	// To avoid floats, convert to int: (2942 * x - 498530 + 5000) / 10000
	// The + 5000 ensures proper rounding to nearest integer
	uint32_t a = 2942;
	uint32_t b = 498529;
	int32_t voltageDrop = (a*dhandle->currentMeas - b + 5000)/10000;
	uint32_t compVoltage;

	// Below 150mA the voltageDrop might be negative
	if (dhandle->currentMeas > 180 && voltageDrop > 0){
		compVoltage = roundToNearest20mV(dhandle->voltageSet*10 + voltageDrop) / 10; //divide by 10 to get [cV]
	}
	else {
		compVoltage = dhandle->voltageSet; // [cV]
	}

	// If corrected value is within limits proceed, else ask for mask Voltage
	compVoltageV = compVoltage;
	return (compVoltage > dhandle->voltageMax) ? dhandle->voltageMax : compVoltage;
}

int32_t roundToNearest20mV(int32_t valueInMv) {

	int32_t sign = (valueInMv < 0) ? -1 : 1;
	int32_t absValue = abs(valueInMv);

	if (absValue % 20 >= 10 && sign == -1) {

	}
	int32_t roundedValueInMv = absValue - (absValue % 20) + ( (absValue % 20 >= 10 && sign == -1) ? 20 : 0);

    return sign*roundedValueInMv;
}

/**
  * @brief  Current measurement correction
  * @param  measuredCurrent: Measured current with ADC [mA]
  * @retval correctedCurrent [mA]
  */
int32_t correctCurrentMeas(uint32_t measuredCurrent) {
	// Using the formula: er = 0.0065 * current + 7.5956 (measured on PinePower)
	// Skew of correction was slightly changed to 0.0059, to better match with other adapters
	// To avoid floats, convert to int: (59 * current + 75956 + 5000) / 10000
	// The + 5000 ensures proper rounding to nearest integer
	uint32_t a = 59;		// Coefficient: 0.059 * 10000
	uint32_t b = 75956;    // Coefficient: 7.9556 * 10000
	int32_t currentError = (a * measuredCurrent + b + 5000) / 10000;
	int32_t correctedCurrent = (int32_t)measuredCurrent - currentError;
	if (correctedCurrent > 3){
		return correctedCurrent;
	}
	else {
		return 0;
	}
}

/**
 * @brief  Corrects voltage measurement to compensate for system errors.
 * Performs two-step correction:
 * 1. Current-dependent compensation: Accounts for losses in shunt resistor, relay and path
 *    Using formula: error = 0.0721 * voltage - 17.279 [mV]
 * 2. Voltage-dependent compensation: Corrects for voltage divider and ADC reference errors
 *    Using formula: error = 0.0000002 * voltage^2 - 0.00989229 * voltage + 107.30097708 [mV]
 *
  * @param  measuredVoltage: Measured voltage on voltage divider with ADC [mV]
  * @retval correctedVoltage: Corrected output voltage [mV]
  */
int32_t correctVoltageMeas(uint32_t measuredVoltage, uint32_t measuredCurrent) {
	// Step 1: Current-dependent compensation
	// Using the formula: er = 0.0721 * current - 17.279 [mV] (measured on PinePower)
	// Integer implementation: (721 * current - 172790 + 5000) / 10000
	int32_t a = 721;		// Coefficient: 0.0721 * 10000
	int32_t b = 172790;    // Coefficient: 17.279 * 10000
	int32_t voltageLoadLoss;
	if (measuredCurrent >= 1) {
		voltageLoadLoss = (a * (int32_t)measuredCurrent - b + 5000) / 10000;
	}
	else {
		voltageLoadLoss = -17; // -b/10000
	}
	currentErrorV = voltageLoadLoss;
	int64_t loadCorrectedVoltage = measuredVoltage - voltageLoadLoss;
	currentCompensatedVoltageV = loadCorrectedVoltage;

	// Compensation in dependence of voltage
	// Using the formula: er = 0.00000020x^2 - 0.00989229x + 107.30097708 (measured on PinePower)
	// To avoid floats, convert to int: (2x^2 - 98923 + 1073009771) / 10000
	int32_t e = 2;   			// Coefficient: 0.0000002 * 10000 = 2/1000
	int32_t f = 99;		// Coefficient: 0.00989229 * 10000
	int64_t g = 1073010;    // Coefficient: 107.30097708 * 10000

	int64_t term1 = (e * (loadCorrectedVoltage/100) * loadCorrectedVoltage/10);
	int64_t term2 = f * loadCorrectedVoltage;
	int64_t term3 = term1 - term2 + g;
	int64_t voltageError = term3 / 10000;
	term1V = term1;
	term2V = term2;
	voltageErrorV = voltageError;

	uint32_t fullyCompensatedVoltage = loadCorrectedVoltage - voltageError;
	fullyCompensatedVoltageV = fullyCompensatedVoltage;

	return fullyCompensatedVoltage;
}

void correctOutputVoltage(void) {
	if (sm->pwrMode == MODE_APDO && sm->currentState == STATE_ACTIVE) {

		dhandle->voltageError = fullyCompensatedVoltageV - dhandle->voltageSet*10; // [mV = mV - cV*10]

		if (abs(dhandle->voltageError) > 30) {
			//round toward zero in 20mV steps
			int32_t voltageErrorRounded = roundToNearest20mV(dhandle->voltageError);  // [mV]
			voltageErrorRoundedV = voltageErrorRounded;

			dhandle->correctedRequestVoltage = dhandle->voltageSet - voltageErrorRounded/(int32_t)10; // [cV = cV - mV/10]

			if (dhandle->correctedRequestVoltage >= dhandle->voltageMax) {
				dhandle->correctedRequestVoltage = dhandle->voltageMax;
			}
			else if (dhandle->correctedRequestVoltage <= dhandle->voltageMin) {
				dhandle->correctedRequestVoltage = dhandle->voltageMin;
			}
			int indexSRCAPDO = USER_SERV_FindSRCIndex(0, &powerRequestDetails, dhandle->correctedRequestVoltage*10, dhandle->currentSet, dhandle ->selMethod);
			// Print to debug
			char _str[100];
			sprintf(_str,"APDO correction request: indexSRCPDO= %i, setVBUS= %lu mV, corVBUS= %lu mV, Ibus= %lu mA", indexSRCAPDO, 10*dhandle->voltageSet, dhandle->correctedRequestVoltage*10, dhandle->currentSet);
			USBPD_TRACE_Add(USBPD_TRACE_DEBUG, 0, 0, (uint8_t*)_str, strlen(_str));
			USBPD_DPM_RequestSRCPDO(0, indexSRCAPDO, dhandle->correctedRequestVoltage*10, dhandle->currentSet);

		}
	}
}
